{
  "test": "تيست",
  "Home": "الرئيسية",
  "About": "من أنا ؟",
  "services": "الخدمات",
  "portfolio": "الأعمال",
  "skills": "المهارات",
  "statistics": "الإحصائيات",
  "Contact": "تواصل معي",
  "megz": " (React JS / Laravel) ميجز | مطور مواقع",
  "Living, learning, & leveling up one day at a time.": "العيش والتعلم والارتقاء يومًا بعد يوم.",
  "contact me": "تواصل معي",
  "powerd by mes": "مدعوم مني",
  "start a new project": "بدء مشروع جديد",
  "Interested in working together? We should queue up a time to chat.": "هل ترغب بالعمل معًا؟ علينا تحديد موعد للدردشة.",
  "let's do it": "دعونا نفعل ذلك",
  "Full Stack Web Developer | Building Smart, Scalable & Beautiful Applications": "مطور ويب Full Stack | أُبدع تطبيقات ذكية، قابلة للتطوير، وتتميز بجمال التصميم",
  "I’m a Full Stack Developer with a passion for building efficient, scalable, and user-friendly web applications. With experience in both front-end and back-end development, I bring ideas to life with clean code, intuitive interfaces, and solid architecture. Always eager to learn, grow, and build impactful digital products.": "مطور Full Stack بخبرة في بناء تطبيقات ويب متكاملة باستخدام أحدث التقنيات. أمتلك القدرة على تحويل الأفكار إلى تطبيقات عملية ذات واجهات استخدام سلسة وأداء قوي. شغوف بتعلم كل جديد في عالم البرمجة، وأسعى دائمًا لتقديم حلول تقنية تواكب احتياجات المستخدمين.",
  "Hi, I'm Maged Elshafey — glad you're here!": "مرحبًا، أنا ماجد الشافعي. سعيد بالتعرّف عليك!",
  "I'm a Full Stack Developer with a passion for crafting complete, scalable, and user-focused web applications. Over the past year, I’ve worked remotely with agencies, supported startups, and collaborated with creative minds to bring digital ideas to life for both businesses and end-users.": "أنا مطور Full Stack متخصص في بناء تطبيقات ويب متكاملة. بدأت رحلتي كمطوّر منذ أكثر من عام، وعملت كمستقل على مشاريع عن بُعد مع وكالات وشركات ناشئة، وشاركت في تنفيذ منتجات رقمية تخدم قطاعات الأعمال والمستهلكين على حد سواء.",
  "I'm a lifelong learner, naturally curious, and always striving to sharpen my skills — one challenge at a time. Whether it's front-end design or back-end logic, I love turning complex problems into elegant digital solutions.": "أتمتع بشغف دائم للتعلم، وفضول طبيعي يدفعني لتجربة كل جديد. أؤمن بأن كل مشكلة تصميم أو برمجة هي فرصة لتطوير مهاراتي، وأسعى دائمًا لتقديم حلول تقنية تجمع بين الأداء والجمال.",
  "Custom Web Applications": "تطبيقات ويب مخصصة",
  "I build tailored web apps from scratch using modern technologies to meet your specific business needs.": "أصمّم تطبيقات ويب من الصفر باستخدام تقنيات حديثة لتناسب متطلباتك التجارية بدقة.",
  "Front-End Development": "تطوير الواجهة الأمامية",
  "Responsive, fast, and visually appealing interfaces using React.js and modern UI libraries.": "واجهات سريعة ومتجاوبة وجذابة بصريًا باستخدام React.js وأحدث مكتبات التصميم.",
  "Back-End Development": "تطوير الواجهة الخلفية",
  "Powerful, secure, and scalable server-side solutions with Laravel": "حلول قوية وآمنة وقابلة للتوسع باستخدام Laravel لتشغيل التطبيق بكفاءة.",
  "API Development & Integration": "تطوير وربط واجهات API",
  "Creating robust APIs and integrating third-party services to boost your app's functionality.": "تطوير واجهات برمجية قوية وربط الخدمات الخارجية لتوسيع وظائف التطبيق.",
  "Admin Dashboards": "لوحات تحكم للإدارة",
  "Building clean, data-driven admin panels for effective business and content management.": "تصميم لوحات تحكم عملية وسهلة لإدارة المحتوى والبيانات وتحليل الأداء.",
  "Full Project Deployment": "نشر المشروع بالكامل",
  "From development to deployment — I handle everything to get your product live and running smoothly.": "من التطوير حتى الإطلاق، أقدّم عملية نشر متكاملة لضمان جاهزية المشروع للعمل بكفاءة.",
  "Web Hosting & Deployment": "استضافة ونشر المواقع",
  "Reliable and secure web hosting solutions to get your site online with minimal downtime.": "حلول استضافة موثوقة وآمنة تضمن تشغيل موقعك على الإنترنت بأداء مستقر ووقت توقف قليل.",
  "Performance Optimization": "تحسين الأداء",
  "Speed up your website with optimized code, image compression, and best performance practices.": "تسريع موقعك من خلال تحسين الكود، وضغط الصور، وتطبيق أفضل ممارسات الأداء.",
  "SEO Optimization": "تحسين محركات البحث (SEO)",
  "Make your website more discoverable on search engines with proper SEO structure and strategy.": "رفع ترتيب موقعك في محركات البحث من خلال بنية سليمة واستراتيجيات SEO فعّالة.",
  "Website Maintenance": "صيانة المواقع",
  "Ongoing updates, bug fixes, and performance checks to keep your website running smoothly": "تحديثات مستمرة، إصلاح الأعطال، ومراقبة الأداء لضمان عمل الموقع بسلاسة طوال الوقت.",
  "Testing & Debugging": "الاختبار وإصلاح الأخطاء",
  "I ensure your website or application runs smoothly by identifying bugs and applying efficient fixes before and after deployment.": "أضمن أن موقعك أو تطبيقك يعمل بدون مشاكل من خلال اكتشاف الأخطاء وإصلاحها بشكل فعّال قبل وبعد الإطلاق.",
  "Code Refactoring & Cleanup": "تحسين وتنظيف الكود",
  "I help improve performance and maintainability by restructuring messy or outdated code without changing its functionality.": "أساعد في تحسين الأداء وسهولة الصيانة من خلال إعادة تنظيم الكود العشوائي أو القديم بدون التأثير على وظائفه.",
  "Security Enhancements": "تعزيز الأمان",
  "I implement secure coding practices, handle authentication/authorization, and protect your app from common threats.": "أطبق أفضل ممارسات الأمان، وأدير صلاحيات الدخول، وأحمي تطبيقك من التهديدات الشائعة.",
  "Need help deciding on architecture, tools, or best practices? I offer expert guidance tailored to your project.": "محتار في اختيار المعمارية أو الأدوات؟ أقدم لك استشارات فنية تناسب مشروعك تمامًا.",
  "Domain & DNS Setup": "إعداد الدومين و DNS",
  "I help you connect your domain to your hosting, configure DNS settings, and ensure everything runs smoothly.": "أساعدك في ربط الدومين بالاستضافة، وضبط إعدادات DNS لضمان عمل الموقع بشكل سليم.",
  "Third-Party Integrations": "دمج خدمات الطرف الثالث",
  "From payment gateways to analytics, I integrate the tools and platforms your business needs.": "من بوابات الدفع لتحليلات الأداء، أدمج كل الأدوات اللي مشروعك محتاجها.",
  "Contact Forms & Email Handling": "نماذج التواصل ومعالجة الإيميلات",
  "I build smart contact forms with proper email handling, spam protection, and backend integration.": "بصمملك نماذج تواصل فعالة مع إرسال الإيميلات، وحماية من الرسائل المزعجة وربط بالخلفية.",
  "Content Management System (CMS) Integration": "ربط نظام إدارة محتوى",
  "I can integrate or build a custom CMS to help you manage your website’s content easily.": "أقدر أدمج أو أطوّر نظام إدارة محتوى مخصص يساعدك تدير محتوى موقعك بكل سهولة.",
  "Technical Consultation": "استشارات تقنية",
  "our services": "خدماتي",
  "View all services": "مشاهدة جميع الخدمات",
  "frontend": "الواجهة الأمامية",
  "backend": "الواجهة الخلفية",
  "tools": "الأدوات والتقنيات",
  "my skills": "مهاراتي",
  "years of experience": "سنوات من الخبرة",
  "client": "عميل",
  "completed project": "مشاريع مكتملة",
  "Welcome to the portfolio of Majed Elshafey – a passionate Full Stack Developer specializing in React.js and PHP Laravel. Explore projects, skills, and contact details all in one place.": "مرحبًا بك في البورتفوليو الخاص بماجد الشافعي – مطور فل ستاك متخصص في React.js و PHP Laravel. تصفح المشاريع، المهارات، ومعلومات التواصل بسهولة."
}
